import scoreDates from "./scoreDates";
const dates = scoreDates();

export const titleToPath = {
  ΑΘΛΗΤΙΣΜΟΣ: "sports",
  ΚΟΣΜΟΣ: "world",
  ΚΟΙΝΩΝΙΑ: "society",
  ΟΙΚΟΝΟΜΙΑ: "economy",
  ΠΟΛΙΤΙΚΗ: "politics",
  ΠΟΛΙΤΙΣΜΟΣ: "culture",
  "ΑΠΟΤΕΛΕΣΜΑΤΑ ΑΓΩΝΩΝ": `scores/${dates[0]}`,
};

export const pathToTitle = {
  sports: "ΑΘΛΗΤΙΣΜΟΣ",
  world: "ΚΟΣΜΟΣ",
  society: "ΚΟΙΝΩΝΙΑ",
  economy: "ΟΙΚΟΝΟΜΙΑ",
  politics: "ΠΟΛΙΤΙΚΗ",
  culture: "ΠΟΛΙΤΙΣΜΟΣ",
  scores: "ΑΠΟΤΕΛΕΣΜΑΤΑ ΑΓΩΝΩΝ",
};

export const categories: { [key: string]: string } = {
  "ΔΙΕΘΝΗΣ ΟΙΚΟΝΟΜΙΑ": "ΟΙΚΟΝΟΜΙΑ",
  ΑΘΛΗΤΙΣΜΟΣ: "ΑΘΛΗΤΙΣΜΟΣ",
  ΠΟΛΙΤΙΣΜΟΣ: "ΠΟΛΙΤΙΣΜΟΣ",
  ΚΟΙΝΩΝΙΑ: "ΚΟΙΝΩΝΙΑ",
  ΚΙΝΗΜΑΤΟΓΡΑΦΟΣ: "ΠΟΛΙΤΙΣΜΟΣ",
  ΜΟΥΣΙΚΗ: "ΠΟΛΙΤΙΣΜΟΣ",
  ΚΟΣΜΟΣ: "ΚΟΣΜΟΣ",
  ΠΟΛΗ: "ΚΟΙΝΩΝΙΑ",
  "ΕΞΩΤΕΡΙΚΗ ΠΟΛΙΤΙΚΗ": "ΠΟΛΙΤΙΚΗ",
  ΓΑΣΤΡΟΝΟΜΟΣ: "ΚΟΙΝΩΝΙΑ",
  ΤΗΛΕΟΡΑΣΗ: "ΠΟΛΙΤΙΣΜΟΣ",
  ΜΟΥΣΕΙΑ: "ΠΟΛΙΤΙΣΜΟΣ",
  ΑΡΧΙΤΕΚΤΟΝΙΚΗ: "ΠΟΛΙΤΙΣΜΟΣ",
  ΠΟΛΙΤΙΚΗ: "ΠΟΛΙΤΙΚΗ",
  "ΕΛΛΗΝΙΚΗ ΟΙΚΟΝΟΜΙΑ": "ΟΙΚΟΝΟΜΙΑ",
  ΤΑΞΙΔΙΑ: "ΚΟΣΜΟΣ",
  ΒΙΒΛΙΟ: "ΠΟΛΙΤΙΣΜΟΣ",
};
